{
    "General": [

        {
            "tag": "Greetings",
            "patterns": ["Hi", "Hey", "How are you", "Is anyone there?", "Hello", "Good day", "What's up", "yo"],
            "responses": ["Hey :-)", "Hello, thanks for visiting", "Hi there, what can I do for you?", "Hi there, how can I help?"]
        },

        {
            "tag": "Goodbyes",
            "patterns": ["Bye", "See you later", "Goodbye"],
            "responses": [ "See you later, thanks for visiting", "Have a nice day", "Bye! Come back again soon."]
        },
        
        {
            "tag": "Thank you",
            "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
            "responses": ["Happy to help!", "Any time!", "My pleasure"]
        },

        {
            "tag": "funny",
            "patterns": ["Tell me a joke!", "Tell me something funny!", "Do you know a joke?"],
            "responses": ["Why did the hipster burn his mouth? He drank the coffee before it was cool.", "What did the buffalo say when his son left for college? Bison." ]
        }
     
    ],

    "Admissions": [
        {
        "Requirements and Deadlines": [
            { 
                "General Deadlines": [

                    {
                    "tag": "Early Action",
                    "patterns": ["When is the deadline for applying?","When is the deadline for early action application?", "When is the deadline for applying to the program for the next term?" ],
                    "responses": ["The deadline for applying to early action is November 1."]
                    },

                    {
                    "tag": "Financial Aid",
                    "patterns": ["When is the deadline for financial aid?", "When should I apply for financial aid ?", "Can I / am I eligible / am I allowed to apply for financial aid ?"],
                    "responses": ["Which term are you applying for?", "The deadline for financial aid for entering fall/winter term is March 31.", 
                        "The deadline for financial aid for entering winter term is Oct 1", 
                        "The deadline for financial aid for entering spring term is May 10",
                        "The deadline for financial aid for entering summer term is June 1", 
                        "Check out the webpage for financial aid deadlines: https://finaid.umich.edu/apply-aid/new-undergraduates/deadlines", 
                        "Refer to this site for financial aid eligibility information: https://finaid.umich.edu/getting-started/qualifying-aid"
                    ]
                    },

                    {
                    "tag": "Regular Application",
                    "patterns": ["When is the deadline for regular application?", "When is the deadline for RD?", "When is the latest I can apply to Michigan?", 
                        "I can't meet the EA/Early Action deadline, what can I do?", "When is the deadline for regular decision?"],
                    "responses": ["Which school within Michigan are you applying to?", 
                        "The deadline for regular action/decision for all schools excluding the school of Music, Theatre and Dance is February 1",
                        "The deadline for applying regular action/decision to the school of Music, Theatre and Dance is December 1", 
                        "Feel free to refer to the following site: https://admissions.umich.edu/apply/first-year-applicants/requirements-deadlines/application-changes"
                        ]
                    }

                ],

                "School Specific Requirements": [
                    {
                    "tag": "LSA",
                    "patterns": [ 
                        "Are interviews required for applying to LSA?", "Are portfolios required for applying to LSA?",
                        "How many years of foreign language do I need to apply to LSA?", 
                        "How many years of English do I need to apply to LSA?", 
                        "How many years of biological and physical sciences do I need to apply to LSA?", 
                        "How many years of mathematics do I need to apply to LSA?", 
                        "How many years of history/social science do I need to apply to LSA?", 
                        "Are essay questions required to applying to LSA?"
                    ],
                    "responses": [ 
                    "No portfolios are required for LSA.", "No interviews are required for LSA",
                    "LSA requires answering the University of Michigan Questions: http://admissions.umich.edu/university-michigan-questions",
                    "LSA requires the completion of at least two years of the same foreign language by the end of senior year in high school", 
                    "LSA requires the completion of four years of English by the end of senior year in high school", 
                    "LSA requires the completion of three years of biological and physical sciences by the end of senior year in high school", 
                    "LSA requires the completion of three years of mathematics by the end of senior year in high school",
                    "LSA requires the completion of three years of history and/or social science by the end of senior year in high school",  
                    "Checkout the following site: https://lsa.umich.edu/lsa/prospective-students/undergraduate/admissions/undergraduate-application.html"
                ]
                    },
    
                    {
                    "tag": "Engineering",
                    "patterns": ["Are there specific requirements for applying to the college of engineering/COE/coe?", 
                    "Do I need a portfolio to apply to the College of Engineering / COE", "Do I need programming experience to apply to the COE / College of Engineering ?"],
                    "responses": ["There will be specific emphasis placed on achievement in math and science courses.", 
                    "The application consists of only the university-wide standard application materials", "No additional materials are needed for the college", 
                    "Check out the college of engineering site: https://www.engin.umich.edu/admissions-aid/undergraduate/apply/"]
                    },
    
                    {
                    "tag": "Ross",
                    "patterns": ["How do I apply to the Ross Bachelor of Business Administration / BBA program?", "Are there specific requirements for applying to Ross/Ross School of Business/Stephen Ross School of Business?", 
                        "Do I need to complete a portfolio for Ross BBA / Bachelor of Business Administration ?", "Can I apply after being admitted to Michigan / the university ?"
                      ],
                    "responses": [
                        "Are you a high school senior or current UM student?",
                        "First year Ross applicants must complete the Ross admissions portfolio consisting of two components: 1) business case discussion 2) artifact & description. Check out this site for details: https://michiganross.umich.edu/undergraduate/bba/admissions/first-year-applicants/admissions-portfolio", 
                        "Check out the following link: https://michiganross.umich.edu/undergraduate/bba/admissions/first-year-applicants", 
                        "Admitted students who attend Michigan can apply to the Ross school as a UM Transfer Applicant. Refer here for details: https://michiganross.umich.edu/undergraduate/bba/admissions/UM-applicants"
                    ]
                    },

                    {
                    "tag": "School of Music, Theatre, and Dance",
                    "patterns": ["Are there specific requirements for applying to the School of Music, Theatre, and Dance?", 
                    "When's the deadline to apply to music/theatre/dance/the school of music, theatre, and dance?", 
                    "Can I apply early action/early decision to the School of Music, Theatre, and Dance?", 
                    "What do I do for the artistic profile?"
                    ],
                    "responses": ["An artistic profile (with a fee of $45), in addition to the general school-wide application, is required.",
                    "You must submit your common application and artistic profile by December 1st the latest.", 
                    "The School of Music, Theatre, and Dance does NOT participate in early action or early decision. There is a single deadline.", 
                    "Information about the artistic profile can be found here: https://smtd.umich.edu/admissions/undergraduate-admissions/apply/", 
                    "Full details about how to apply can be found here: https://smtd.umich.edu/admissions/undergraduate-admissions/apply/"]
                    },

                    {
                    "tag": "School of Kinesiology",
                    "patterns": ["Are there specific requirements for applying to the School of Kinesiology for first year students?", 
                        "How many years of foreign language do I need to apply to the School of Kinesiology?",
                        "How many years of English do I need to apply to the School of Kinesiology?",
                        "How many years of Science do I need to apply to the School of Kinesiology?",
                        "How many years of history and social science do I need to apply to the School of Kinesiology?",
                        "What do I need to apply the school of kinesiology for first year admissions?"
                    ],
                    "responses": ["You will need to meet the minimum high school course requirements outlined here: https://www.kines.umich.edu/admissions-aid/undergraduate/first-year", 
                        "The School of Kinesiology requires the completion of at least two years of the same foreign language by the end of senior year in high school", 
                        "The School of Kinesiology requires the completion of at least three years of mathematics by the end of senior year in high school",
                        "The School of Kinesiology requires the completion of at least three years of science by the end of senior year in high school",
                        "The School of Kinesiology requires the completion of at least three years of social science and history by the end of senior year in high school",
                        "Detailed information about first year admissions requirements can be found here: https://www.kines.umich.edu/admissions-aid/undergraduate/first-year"
                    ]
                    },

                    {
                    "tag": "School of Nursing",
                    "patterns": ["Are there specific requirements for applying to the School of Nursing / BSN program for first year students?",
                        "How many years of foreign language do I need to apply to the BSN Program / School of Nursing Undergrad",
                        "How many years of English do I need to apply to the BSN Program/School of Nursing Undergrad?",
                        "How many years of Science do I need to apply to the BSN Program/School of Nursing Undergrad?",
                        "How many years of history and social science do I need to apply to the BSN Program / School of Nursing Undergrad?"],
                    "responses": [
                        "Which program are you applying to?",
                        "Specific course requirements exist for the BSN program. Refer to the school specific requirements here: https://nursing.umich.edu/admissions-aid/application-information/requirements/bsn-program-freshmen-students", 
                        "The BSN program requires the completion of at least two units of the same foreign language by the end of senior year in high school", 
                        "The BSN program requires the completion of at least three units of mathematics including second-year algebra and geometry",
                        "The BSN program requires the completion of two units of social science by the end of senior year in high school",
                        "The BSN program requires the completion of four years of science by the end of senior year in high school" 
                    ]
                    },

                    {
                    "tag": "Stamps School of Art and Design",
                    "patterns": ["How do I apply to the Stamps School of Art and Design?", 
                    "Do I need a portfolio to apply to the BFA program?", "Do I need a portfolio to apply to the BA program?",
                    "Do I need a portfolio to apply to the Stamps School of Art and Design", 
                    "Are there specific requirements for applying to the Stamp School of Art and Design?"
                    ],
                    "responses": ["Which program are you applying to (Art and Design/Interarts Performance)?", 
                    "Information about the Art and Design program application can be found under the header BFA/BA in Art & Design on this page: https://stamps.umich.edu/undergraduate-admissions/apply",
                    "Information about the Interarts Performance program application can be found under the header BFA in Interarts Performance on this page: https://stamps.umich.edu/undergraduate-admissions/apply"
                    ]
                    },
                    
                    {
                    "tag": "Taubman College of Architecture and Urban Planning",
                    "patterns": ["Are there specific requirements for applying to the Taubman College of Architecture and Urban Planning ?", 
                        "Do I need a portfolio to apply ?", "Do I need a portfolio for the Bachelor of Science in Urban Technology / BS in UT ?", 
                    "Do I need a portfolio to apply / do architecture ? "],
                    "responses": ["Which program are you applying to?",
                    "The Architecture program requires a portfolio that is submitted through Slideroom. For more information please refer to the content under 'SUBMITTING YOUR PORTFOLIO' on this page: https://taubmancollege.umich.edu/architecture/admissions/apply/bachelor-science-first-year",
                    "The Urban Technology program does NOT require a portfolio. Learn more here: https://taubmancollege.umich.edu/urbanplanning/admissions/apply/bachelor-science-urban-technology"
                ]  
                }
                ],

                "General Essay Questions": [

                    {
                    "tag": "Essay Prompts",
                    "patterns": ["What are the essay prompts?", "What essays do I need to write?"],
                    "responses": 
                    ["Individual schools may have additional essay prompts. These are the University wide essay prompts: Prompt 1: Everyone belongs to many different communities and/or groups defined by (among other things) shared geography, religion, ethnicity, income, cuisine, interest, race, ideology, or intellectual heritage. Choose one of the communities to which you belong, and describe that community and your place within it. (Required for all applicants) Prompt 2: Describe the unique qualities that attract you to the specific undergraduate College or School (including preferred admission and dual degree programs) to which you are applying at the University of Michigan. How would that curriculum support your interests? (Required for all applicants)"]
                    }
                ],

                "Selection": [
                        
                    {
                    "tag": "Acceptance Rate",
                    "patterns": ["What is the acceptance rate?"],
                    "responses": ["Last year, 16,235 applicants were offered admission from a pool of 83,029. Yielding an acceptance rate of 18.2%"]
                    },

                    {
                    "tag": "Average stats",
                    "patterns": ["What was last year's average ACT Score ?", "What was last year's average SAT Score ?"],
                    "responses": ["The average ACT score for last year was 34",  
                    "The average SAT score is 1435."]
                    }
                ]
            }
        ]}
    ]




}